[
    {
        "title": "Gmail Inbox",
        "url": "https://mail.google.com/mail/u/0/#inbox",
        "description": "Direct link to your Gmail inbox for accessing, reading, and managing emails. Useful for quickly jumping to your primary email interface.",
        "tags": [
            "gmail",
            "email",
            "google",
            "inbox",
            "tools"
        ],
        "notes": "Use this URL to quickly open your Gmail inbox in a logged-in session. Not shareable unless the receiver has access to your account.",
        "updatedAt": "8 July 2025"
    },
    {
        "title": "Git Hub",
        "url": "https://github.com/Aman235-code",
        "description": "My GitHub profile where I store all my projects, code samples, and open-source experiments. This is also used for collaboration and version control.",
        "tags": [
            "tools",
            "open-source",
            "git-hub"
        ],
        "notes": "Tracking the code and pushing daily updates.",
        "updatedAt": "7 July 2025"
    },
    {
        "title": "YouTube",
        "url": "https://youtube.com",
        "description": "The largest video-sharing platform where you can watch tutorials, tech reviews, documentaries, and coding walkthroughs.",
        "tags": [
            "video",
            "learning",
            "tools",
            "tech"
        ],
        "notes": "Follow channels like Fireship, Web Dev Simplified, and Traversy Media for dev content.",
        "updatedAt": "8 July 2025"
    },
    {
        "title": "ChatGPT",
        "url": "https://chatgpt.com",
        "description": "AI chatbot by OpenAI that helps with programming, writing, brainstorming, and much more. It's a powerful productivity assistant for developers, students, and creators.",
        "tags": [
            "ai",
            "tools",
            "writing",
            "assistant"
        ],
        "notes": "I use it daily for debugging, project ideas, and learning new tech fast.",
        "updatedAt": "8 July 2025"
    },
    {
        "title": "Google Maps",
        "url": "https://maps.google.com",
        "description": "Use Google Maps for navigation, traffic info, and discovering nearby places like restaurants, gas stations, and ATMs. It offers satellite views, real-time directions, and saved locations.",
        "tags": [
            "tools",
            "navigation",
            "location",
            "travel"
        ],
        "notes": "Use 'Your Places' to pin locations I visit often or want to remember.",
        "updatedAt": "8 July 2025"
    },
    {
        "title": "Vercel",
        "url": "https://vercel.com",
        "description": "Vercel is a cloud platform for hosting front-end frameworks and static sites, especially optimized for React, Next.js, Vue, and Svelte. Offers instant deployments, GitHub integration, serverless functions, analytics, and custom domains.",
        "tags": [
            "tools",
            "deployment",
            "hosting",
            "frontend"
        ],
        "notes": "I use it to instantly deploy all my React and Vite projects. Super fast with GitHub integration!",
        "updatedAt": "8 July 2025"
    },
    {
        "title": "Netlify",
        "url": "https://www.netlify.com",
        "description": "Netlify is a powerful cloud hosting platform for static websites and JAMstack apps. It supports continuous deployment from Git, custom domains, serverless functions, form handling, and edge functions — all with a simple developer-friendly workflow.",
        "tags": [
            "tools",
            "deployment",
            "hosting",
            "jamstack"
        ],
        "notes": "I use Netlify for quick deploys of HTML, JS, and Tailwind projects. Built-in form support is super handy!",
        "updatedAt": "8 July 2025"
    },
    {
        "title": "SVGRepo",
        "url": "https://www.svgrepo.com/",
        "description": "A massive free library of over 500,000 SVG vector icons and illustrations. Great for designers, developers, and UI creators looking for clean and customizable graphics.",
        "tags": [
            "design",
            "icons",
            "svg",
            "resources"
        ],
        "notes": "Use for downloading high-quality SVG icons and illustrations. Supports searching by keyword and style.",
        "updatedAt": "8 July 2025"
    },
    {
        "title": "Formspree Contact API",
        "url": "https://formspree.io/forms/mzzgwaqd/integration",
        "description": "Formspree provides a simple way to handle form submissions for static sites. This specific page contains the API integration details for the contact form used in my blog and portfolio project.",
        "tags": [
            "forms",
            "api",
            "contact",
            "tools"
        ],
        "notes": "Use this link when configuring contact form integration in React projects using Formspree's POST endpoint.",
        "updatedAt": "8 July 2025"
    },
    {
        "title": "MongoDB Atlas Cluster",
        "url": "https://cloud.mongodb.com/v2/67286517077cc50840560501#/clusters",
        "description": "MongoDB Atlas is a fully managed cloud database service for MongoDB. This link leads to the cluster dashboard where I manage databases, monitor performance, connect my apps securely, and handle backup and scaling configurations.",
        "tags": [
            "database",
            "mongodb",
            "cloud",
            "backend"
        ],
        "notes": "Use this to manage cluster connections and access credentials for full-stack projects using MongoDB.",
        "updatedAt": "8 July 2025"
    },
    {
        "title": "Cohere API Keys Dashboard",
        "url": "https://dashboard.cohere.com/api-keys",
        "description": "This page allows you to generate and manage API keys for accessing Cohere's NLP services. Required for integrating Cohere into your React/Node projects.",
        "tags": [
            "cohere",
            "api",
            "nlp",
            "keys",
            "tools"
        ],
        "notes": "Use this page to copy your API key and integrate it securely in your backend when calling Cohere endpoints.",
        "updatedAt": "8 July 2025"
    },
    {
        "title": "WeatherAPI Key Dashboard",
        "url": "https://www.weatherapi.com/my/",
        "description": "This page provides access to your API key and usage stats for WeatherAPI.com, a service used to fetch real-time weather data in web and mobile apps.",
        "tags": [
            "weather",
            "api",
            "weatherapi",
            "tools",
            "keys"
        ],
        "notes": "Use this page to get your WeatherAPI key and track quota usage. Ideal for weather apps built with React and Node.",
        "updatedAt": "8 July 2025"
    },
    {
        "title": "Weather App (Vercel)",
        "url": "https://weather-api-lac-pi.vercel.app/",
        "description": "A simple and responsive weather application built using React, Tailwind CSS, and WeatherAPI.com. It displays current weather details for any city entered by the user.",
        "tags": [
            "weather",
            "react",
            "tailwind",
            "vercel",
            "project"
        ],
        "notes": "Deployed on Vercel. This app fetches real-time weather data using the WeatherAPI.com key and provides a user-friendly UI with Lucide icons and Framer Motion animations.",
        "updatedAt": "8 July 2025"
    },
    {
        "title": "LightPDF - Edit PDF Online",
        "url": "https://lightpdf.com/edit-pdf",
        "description": "A free and easy-to-use online PDF editor that allows you to add text, images, shapes, and annotations directly to your PDF files from the browser with no installation needed.",
        "tags": [
            "pdf",
            "editor",
            "tool",
            "webapp",
            "free"
        ],
        "notes": "No sign-up required. Supports uploading PDFs for direct editing in the browser. Also offers tools like highlight, text addition, shapes, and drawing.",
        "updatedAt": "9 July 2025"
    },
    {
        "title": "Google Gemini (AI Assistant)",
        "url": "https://gemini.google.com/app",
        "description": "Google’s multimodal AI assistant app, formerly Bard, now available as a web and mobile interface to the Gemini family of AI models—capable of handling text, voice, images, video, and more.",
        "tags": [
            "ai",
            "assistant",
            "multimodal",
            "google",
            "webapp",
            "mobile"
        ],
        "notes": "Accessible via web, Android and iOS. Features include Gemini Live voice interaction, image generation, file summarization, integration with Gmail, Drive, Maps and more, customizable 'Gems' chatbots, and support for long‑context workflows via uploads and deep research.",
        "updatedAt": "9 July 2025"
    },
    {
        "title": "Imgflip – Meme & GIF Maker",
        "url": "https://imgflip.com/",
        "description": "A fast and flexible web‑based meme and GIF creator, offering over a million popular meme templates, customizable text, stickers, drawings, animations, and AI‑powered caption generation.",
        "tags": [
            "meme",
            "gif",
            "editor",
            "ai",
            "webapp",
            "free"
        ],
        "notes": "Create memes and GIFs without sign‑up. Supports text, stickers, custom fonts (1,300+), drawings, image filters, meme chains, animated GIFs and video‑to‑GIF conversion. ",
        "updatedAt": "9 July 2025"
    },
    {
        "title": "Humbot AI — Humanizer & AI Detector Bypass",
        "url": "https://humbot.ai/",
        "description": "A web‑based AI humanizer that rewrites AI‑generated text to make it more natural, bypass AI‑detection tools like GPTZero and Turnitin, and produce plagiarism‑free, human‑like content.",
        "tags": [
            "ai",
            "humanizer",
            "rewriter",
            "detector‑bypass",
            "webapp",
            "free‑plan"
        ],
        "notes": "Free plan available (limited words). No login required for basic use. Offers built‑in AI detector, paraphrase modes including Academic, API access starting at ~$30/mo for 50,000 words.",
        "updatedAt": "9 July 2025"
    },
    {
        "title": "Hacksplaining – Interactive Security Lessons",
        "url": "https://hacksplaining.com/lessons",
        "description": "A completely free, browser‑based, interactive security training platform that teaches developers how to identify and fix common web vulnerabilities through hands‑on exercises.",
        "tags": [
            "security",
            "web",
            "owasp",
            "training",
            "webapp",
            "free"
        ],
        "notes": "Covers 30+ real vulnerabilities (e.g. SQL Injection, XSS, CSRF, open redirect, file upload flaws) with live demos, code and explanations. ",
        "updatedAt": "9 July 2025"
    },
    {
        "title": "Cobalt Tools – Media Downloader",
        "url": "https://cobalt.tools/",
        "description": "A privacy-first, ad‑free web app that enables you to download videos, audio, GIFs, and images from popular platforms by simply pasting a public link.",
        "tags": [
            "media",
            "downloader",
            "video",
            "audio",
            "gif",
            "webapp",
            "free"
        ],
        "notes": "Supports YouTube (videos, Shorts, music), TikTok, Instagram Reels, Facebook, Twitter/X, Vimeo, Reddit, SoundCloud and others. No signup required, zero ads or trackers, with on‑device processing where possible for privacy.",
        "updatedAt": "9 July 2025"
    },
    {
        "title": "BugMeNot – Shared Login Database",
        "url": "https://bugmenot.com/",
        "description": "A community‑driven service that provides usernames and passwords for websites requiring free registration, letting users bypass sign‑up walls without using personal email.",
        "tags": [
            "privacy",
            "login",
            "database",
            "webapp",
            "free",
            "anon"
        ],
        "notes": "Launched in August 2003, BugMeNot allows sharing of public login credentials for thousands of sites—excluding pay‑walled services. No signup required.",
        "updatedAt": "9 July 2025"
    },
    {
        "title": "Grok – AI Chatbot by xAI",
        "url": "https://grok.com/",
        "description": "A conversational AI assistant developed by Elon Musk’s xAI offering real‑time answers, reasoning, meme‑smarts, text and image generation, and integration with X (formerly Twitter).",
        "tags": [
            "ai",
            "chatbot",
            "xai",
            "real‑time",
            "multimodal",
            "webapp",
            "mobile",
            "subscription"
        ],
        "notes": "Launched Nov 3, 2023; latest stable version is Grok‑3 released Feb 17, 2025. Features include DeepSearch and 'Think' reasoning agents, image generation, and mobile/web access for Premium+ and SuperGrok subscribers.",
        "updatedAt": "9 July 2025"
    },
    {
        "title": "OpenAI.fm – Free Text‑to‑Speech Demo",
        "url": "https://www.openai.fm/",
        "description": "An interactive web-based demo showcasing OpenAI’s next‑generation text‑to‑speech model (gpt‑4o‑mini‑tts), enabling expressive, emotional, and multilingual voice output.",
        "tags": [
            "tts",
            "text-to-speech",
            "openai",
            "audio",
            "webapp",
            "free",
            "demo"
        ],
        "notes": "Offers over a dozen preset voices (e.g. Alloy, Ash, Ballad, Coral, Echo, Fable) and selectable emotional ‘vibes’ like dramatic or medieval. ",
        "updatedAt": "9 July 2025"
    },
    {
        "title": "Qwen Chat – Qwen AI by Alibaba Cloud",
        "url": "https://chat.qwen.ai/",
        "description": "A free and powerful multimodal chatbot by Alibaba Cloud powered by the Qwen model family, supporting text, image, audio, video input and generation, document analysis, web search integration and coding assistance.",
        "tags": [
            "ai",
            "chatbot",
            "multimodal",
            "alibaba",
            "qwen",
            "webapp",
            "free"
        ],
        "notes": "Offers guest mode with no signup. Built on the open‑source Qwen 2.5‑Omni and latest Qwen 3 models (released April 28, 2025 under Apache 2.0 license), featuring up to 128 000‑token context window, real‑time reasoning, video/image understanding, document uploads, code generation and translation in 119 languages.",
        "updatedAt": "9 July 2025"
    }
]